export interface DescribeDDosEventIspResponse {
    /**
     * 本次请求的ID。
     * @example `C4A3BCD1-4A32-4342-941A-4745AE69508C`
     */
    RequestId: string;
    /**
     * 攻击来源网络运营商信息。
     */
    Isps: {
        /**
         * 来自该网络运营商的请求包数量。
         * @example `230`
         */
        InPkts: number;
        /**
         * 攻击来源网络运营商的代码。取值：
         * - **100017**：电信
         * - **100026**：联通
         * - **100025**：移动
         * - **100027**：教育网
         * - **100020**：铁通
         * - **1000143**：鹏博士
         * - **100080**：歌华
         * - **1000139**：广电
         * - **100023**：有线通
         * - **100063**：方正宽带
         * - **1000337**：皓宽网络
         * - **100021**：世纪互联
         * - **1000333**：华数传媒
         * - **100093**：网宿
         * - **1000401**：腾讯
         * - **100099**：百度
         * - **1000323**：阿里云
         * - **100098**：阿里巴巴
         * @example `1000323`
         */
        Isp: string;
    }[];
}
