export interface RecognizeEduPaperCutResponse {
    /**
     * 请求唯一 ID
     * @example `43A29C77-405E-4CC0-BC55-EE694AD00655`
     */
    RequestId: string;
    /**
     * 返回数据
     * @example `{"page_list":[{"angle":0,"doc_index":1,"height":7000,"orgHeight":7000,"orgWidth":4716,"page_id":-1,"subject_list":[{"content_list_info":[{"doc_index":1,"pos":[{"x":337,"y":1644},{"x":2313,"y":1641},{"x":2313,"y":2234},{"x":337,"y":2234}]}],"ids":["1"],"is_multipage":false,"prism_wordsInfo":[{"pos":[{"x":337,"y":1644},{"x":2313,"y":1641},{"x":2313,"y":1715},{"x":337,"y":1719}],"word":"1.[2017·高密期末]三角形按角分类可以分为()"},{"pos":[{"x":462,"y":1777},{"x":1925,"y":1774},{"x":1925,"y":1846},{"x":462,"y":1849}],"word":"A.锐角三角形、直角三角形、钝角三角形"},{"pos":[{"x":456,"y":1904},{"x":2004,"y":1904},{"x":2004,"y":1976},{"x":456,"y":1976}],"word":"B.等腰三角形、等边三角形、不等边三角形"},{"pos":[{"x":456,"y":2034},{"x":1633,"y":2033},{"x":1633,"y":2104},{"x":456,"y":2105}],"word":"C.直角三角形、等腰直角三角形"},{"pos":[{"x":453,"y":2164},{"x":1261,"y":2164},{"x":1261,"y":2233},{"x":453,"y":2234}],"word":"D.以上答案都不正确"}],"text":"1.[2017·高密期末]三角形按角分类可以分为( ) A.锐角三角形、直角三角形、钝角三角形B. 等腰三角形、等边三角形、不等边三角形C.直角三角形、等腰直角三角形D.以上答案都不正确"}],"width":4716}]}`
     */
    Data: string;
    /**
     * 状态码（如果识别成功，不会返回此字段）
     * @example `如果识别成功，不会返回此字段`
     */
    Code: string;
    /**
     * 详细信息（如果识别成功，不会返回此字段）
     * @example `如果识别成功，不会返回此字段`
     */
    Message: string;
}
