export interface RecognizeEstateCertificationResponse {
    /**
     * 请求唯一 ID
     * @example `43A29C77-405E-4CC0-BC55-EE694AD00655`
     */
    RequestId: string;
    /**
     * 返回数据
     * @example `{"data":{"证号":"(2017)于都县不动产权第0018896号","权利人":"辛巴、傅娜娜","共有情况":"共同共有","坐落":"于都县贡江镇长龙路延伸段龙景嘉园","用途":"城镇住宅用地/其它","面积":"分摊土地使用权面积：4.1㎡/房屋建筑面积：23.73㎡","使用期限":"2008年06月01日起2058年06月01日止","不动产单元号":"360731012016GB00903F00020232","权利类型":"国有建设用地使用权/房屋(构筑物)所有权","权利性质":"出让/市场化商品房","房屋建筑面积":"23.73","丘权号":"","权利其他状况":"共有宗地面积：5611.07m'专有建筑面积：23.12m，分摊建筑面积：0.61m房屋结构：钢筋混凝土结构房屋总层数：6，房屋所在层：1房屋竣工时间：2015年12月31日持证方式：共同持证持证人：辛巴、傅娜娜汉"},"height":1133,"orgHeight":1133,"orgWidth":713,"prism_keyValueInfo":[{"key":"证号","keyProb":100,"value":"(2017)于都县不动产权第0018896号","valuePos":[{"x":83,"y":52},{"x":664,"y":28},{"x":665,"y":53},{"x":85,"y":78}],"valueProb":100}],"width":713}`
     */
    Data: string;
    /**
     * 状态码
     * @example `200`
     */
    Code: string;
    /**
     * 详细信息
     * @example `message`
     */
    Message: string;
}
